{
    "projects": [
        {
            "name": "Ninjas on Trampolines",
            "description" : "🏆<b>Best Experimental Game at RIT EDGE</b>🏆<br>A Platform Fighter that relies on physics-based trampolines.",
            "coverImage": "media/ninjas/ninjas.gif",
            "trailerEmbed": "https://www.youtube.com/embed/zA0I3a7yrLU?autoplay=1",
            "role": "<lead-programmer></lead-programmer> / <systems-designer></systems-designer>",
            "teamSize": "7",
            "engine": "Unity",
            "tools": "C#, Python, Git, Gimp, Unity Profiling",
            "duration": "1 Year",
            "docs": "https://docs.google.com/document/d/1VzbaXHNuhw9445c2Qm5PXf4R0Jn5yNRlm7IDgVhKtI4/edit#heading=h.qyxnk3d3ngnk",
            "overview": "Ninjas on Trampolines is a physics-based platform fighter, where players play as Ninjas that can paint their own colors on the wall. The objective of the game is to have the most of your own color on the back wall by the end of a match, which can be done by smacking other players, or using a spray can to graffiti the background.<br>&emsp;The game features three different gamemodes: Free-for-All, Spray King, and Paintball. Each gamemode takes a twist on the simple, yet extremely captivating game loop of Free-for-All by introducing new objectives for players. Paintball has players chase a soccer ball-like object, while Spray King has players chase another player holding an item that gives them an advantage.",
            "goals": [
                "To create a simple and captivating game loop.",
                "Improve my knowledge of implementing physics in games.",
                "Optimize our codebase and shaders to minimize latency.",
                "To experiment with multiplayer backends and networking solutions.",
                "Have a game that I am proud to publish on a digital store."
            ],
            "responsibilities": "During the first few months of development, my main priorities were in the area of developing systems for the game, including player mechanics, trampoline physics, paint score calculations, and creating data structures to store player data.<br>&emsp;For player phhysics, I ended up utilizing Unity's in-built rigidbodies and heavily modified their physics to create fast-paced, yet still controllable, movement. This was done by introducing a dozen or so parameters housed in two C# scripts, which would tweak various aspects of how the player moved and how they would react to physics events. I spent a few weeks tweaking these scripts to get players moving exactly how our team wanted them to.",
            "photoGallery": [
                {
                    "url": "media/ninjas/ninjas_logo.png",
                    "subtitle": "Logo for Ninjas on Trampolines"
                },
                {
                    "url": "media/ninjas/ninjas_screenshot.png",
                    "subtitle": "Typical Gameplay"
                }
                
            ]
        },
        {
            "name": "Icarus VR",
            "description" : "A Virtual Reality archery simulator with realistic gameplay elements.",
            "coverImage": "media/icarus/icarus.gif",
            "trailerEmbed": "https://www.youtube.com/embed/RV0TUgQLj-Y?autoplay=1",
            "role": "Icarus VR is a virtual reality game that has fast-paced gun shooting and skill-based bow and arrow mechanics. Players compete in sky islands, each with its own unique features and challenges. The game offers a variety of game modes, such as Target Frenzy, Quick Draw, and Archery, each having a server-side leaderboard. Developed in Unity.<br><br>During the Spring of 2023, I worked as a <game-developer></game-developer> and <ui-designer></ui-designer> on this project, implementing core gameplay mechanics and backend systems that manage server-side storage of player data.",
            "link": "https://sciencedoge.itch.io/icarus-vr",
            "photoGallery": [
                "media/icarus/icarus1.jpg",
                "media/icarus/icarus2.jpg"
            ]
        },
        {
            "name": "Changeling VR",
            "description" : "A Virtual Reality Mystery experience.",
            "coverImage": "media/changeling/changeling.gif",
            "trailerEmbed": "https://www.youtube.com/embed/nZGJtnUvC2I?autoplay=1",
            "role": "Changeling is a VR mystery, first-person 3D platformer game built upon the idea of magical realism and a sense of unease and wonder. You play as Aurelia, a dream-walker who has the ability to see through the eyes of anyone she touches. You are tasked with helping this family figure out what is wrong with their child, and as you contact each member, you see through the lens of their hopes and fears of what the child is.<br><br> During the Summer of 2023, I worked as a <ui-designer></ui-designer> to improve team workflow and general functionality of core gameplay mechanics. Notable inclusions that I worked on are the player's physics-based hands and the teleportation system. I also assisted with various needs from all of the development teams, and was responsible for building the executable at the end of development sprints.",
            "link": "https://www.changelingvr.com/",
            "photoGallery": [
                "media/changeling/changeling1.png",
                "media/changeling/changeling2.png",
                "media/changeling/changeling5.png",
                "media/changeling/changeling6.png"
            ]
        },
        {
            "name": "**[TODO]** Helpless",
            "description" : "A 1-Bit Space Shooter taking inspiration from classic arcade games.",
            "coverImage": "media/02.png",
            "trailerEmbed": "https://www.youtube.com/embed/OlgM1a4RoXk?autoplay=1",
            "role": "Dark Matter is a 1-bit space shooter game made in a week for the <b>1-BIT 2023 Game Jam.</b> The project is made primarily in C++ and uses the raylib library for development support. Dark Matter garnered much attention during the period of the jam, garnering over 60 ratings and being the fourth most rated game.<br><br>During the Summer of 2023, I was a <game-developer></game-developer> for this project, devoting a week of my time to make the gameplay feel and function the best that it can. This paid off, as Dark Matter was one of the highest rated games in terms of gameplay.",
            "link": "https://prestosilver.itch.io/dark-matter",
            "photoGallery": [  
                "media/darkmatter/darkmatter1.png",
                "media/darkmatter/darkmatter2.png",
                "media/darkmatter/darkmatter3.png"
            ]
        },
        
        {
            "name": "Dark Matter",
            "description" : "A 1-Bit Space Shooter taking inspiration from classic arcade games.",
            "coverImage": "media/darkmatter/darkmatter.gif",
            "trailerEmbed": "https://www.youtube.com/embed/OlgM1a4RoXk?autoplay=1",
            "role": "Dark Matter is a 1-bit space shooter game made in a week for the <b>1-BIT 2023 Game Jam.</b> The project is made primarily in C++ and uses the raylib library for development support. Dark Matter garnered much attention during the period of the jam, garnering over 60 ratings and being the fourth most rated game.<br><br>During the Summer of 2023, I was a <game-developer></game-developer> for this project, devoting a week of my time to make the gameplay feel and function the best that it can. This paid off, as Dark Matter was one of the highest rated games in terms of gameplay.",
            "link": "https://prestosilver.itch.io/dark-matter",
            "photoGallery": [  
                "media/darkmatter/darkmatter1.png",
                "media/darkmatter/darkmatter2.png",
                "media/darkmatter/darkmatter3.png"
            ]
        },
        {
            "name": "Liftin n' Giftin",
            "description" : "A Christmas survival game!",
            "coverImage": "media/liftin/liftin.gif",
            "trailerEmbed": "https://www.youtube.com/embed/hiMK1tYQ82w?autoplay=1",
            "role": "Liftin n' Giftin is a survival game revolving around lifting a heavy anvil-barbell to make gifts for Christmas. The game was made in the Godot game engine for the Jam Game 2023 Winter Game Jam. I worked as a <game-developer></game-developer> in a group of 2, programming the physics of the barbell and the logic for the gifts and elves.",
            "link": "https://prestosilver.itch.io/liftin",
            "photoGallery": [
                "media/liftin/liftin.png"
            ]
        },
        {
            "name": "Doodle Day",
            "description" : "🏆<b>3rd Place Winner at Wolfjam 2023</b>🏆<br>Made in under 24 hours.",
            "coverImage": "media/doodleday/doodleday.gif",
            "trailerEmbed": "https://www.youtube.com/embed/_gJh6aqzuP8?autoplay=1",
            "role": "Doodle Day is a simulation made in 24 hours for the Wolfjam Hackathon 2023. The primary goal of the game is to use a rubber mallet to defeat aliens that appear on your screen, which look cartoon-ish and make cartoon sound effects. However, there is also a news tab that reveals a darker side of what you are doing, which is affecting life beside you negatively. The game ends as you destroy your own planet.<br><br>During the Fall of 2023, I worked as a <game-developer></game-developer> and <software-developer></software-developer>, implementing much of the core functionality of the experience. The project recieved 3rd place out of 18 teams that participated in the hackathon.",
            "link": "https://prestosilver.itch.io/d-day",
            "photoGallery": [
                "media/doodleday/doodleday-1.png",
                "media/doodleday/doodleday-2.png",
                "media/doodleday/doodleday-3.png",
                "media/doodleday/doodleday-4.png"
            ]
        },
        {
            "name": "Myne Graphics Engine",
            "description" : "A 2D Graphics, Audio, and Physics Engine using C++ and OpenGL.",
            "coverImage": "media/myne/myne.gif",
            "trailerEmbed": "https://www.youtube.com/embed/mnMgia8DV6g?autoplay=1",
            "role": "Myne Graphics Engine is a game engine that fully supports rendering 2D bitmaps and glyphs, playing back .wav files, and performing physics calculations between objects via the built-in math functions.<br><br>For multiple years, I have worked on this project as a <software-developer></software-developer>, iterating upon it to improve the engine's speed and user-friendliness. This was created from scratch using C++ and OpenGL to test my programming and computer graphics knowledge. ",
            "link": "https://github.com/scc8371/DiMyne-Engine",
            "photoGallery": [  
            ]
        },
        {
            "name": "Audio Visualizer",
            "description" : "A Web Application that visualizes audio frequencies. ",
            "coverImage": "media/visualizer/visualizer.gif",
            "trailerEmbed": "https://www.youtube.com/embed/bI0-IUr1g7M?autoplay=1",
            "role": "An Audio Visualizer created using JavaScript's canvas and web audio APIs. The controls of the application were integrated through the datgui library. This project was created in hopes to give users as much customizability as possible, letting them customize how the visualizer works in several different aspects.<br><br>During the Spring of 2023, I was tasked as a <software-developer></software-developer> to create this for a class. I went above and beyond the expectations of this assignment, putting an excess of functionality that made this project shine over others.",
            "link": "visualizer/index.html",
            "photoGallery": [  
            ]
        },
        {
            "name": "Roll Arena 64",
            "description" : "A Dice Rolling Game made for the GMTK Game Jam 2022.",
            "coverImage": "media/rollarena/rollarena.gif",
            "trailerEmbed": "https://www.youtube.com/embed/z6m6COi9G5M?autoplay=1",
            "role": "A 3D Unity prototype created in the span of 2 days for the GMTK Game Jam 2022. Players control a blue dice and can roll onto different sides, each representing a pattern that is drawn on the floor. The objective of the game is to have the most of your color on the floor before the round counter reaches zero. This project garnered a successful rating during the jam, just missing a top 1000 placement out of over 6000 entries.<br><br>During the Summer of 2022, I worked as a <game-developer></game-developer> and implemented the functionality of AI opponents, as well as the logic of painting the ground.",
            "link": "https://prestosilver.itch.io/ra64",
            "photoGallery": [  
                "media/rollarena/rollarena1.jpg",
                "media/rollarena/rollarena2.jpg",
                "media/rollarena/rollarena3.png"
            ]
        },
        {
            "name": "Bottle Knights!",
            "description" : "A 2D Web idle game made in JavaScript and pixi.JS",
            "coverImage": "media/bottleknights/bottleknights.gif",
            "trailerEmbed": "https://www.youtube.com/embed/WR9k8mJyouc?autoplay=1",
            "role": "Bottle Knights is a 2D Web Idle game developed from scratch in JavaScript and the pixi.JS library. The player interacts with the game by pressing buttons located on the browser DOM to upgrade their character and gain bonuses that last until the end of the game.<br><br>During the Spring of 2021, I was tasked as a <game-developer></game-developer> to create this for a class after learning the essentials of web development.",
            "link": "bottle-knights/index.html",
            "photoGallery": [  
                    "media/bottleknights/bottleknights1.png", 
                    "media/bottleknights/bottleknights2.png",
                    "media/bottleknights/bottleknights3.png",
                    "media/bottleknights/bottleknights4.png"
            ]
        },
        {
            "name": "Karnissa's Castle",
            "description" : "A 3D Puzzle game taking inspiration from the World of Ethshar.",
            "coverImage": "media/karnissascastle/karnissa.gif",
            "trailerEmbed": "https://www.youtube.com/embed/ZeVq3YvQDkc?autoplay=1",
            "role": "Karnissa's Castle is a 3D puzzle game created in Unity, inspired by the World of Ethshar book series. The fundamental mechanics of the game revolve around switching between two characters to solve one puzzle.<br><br>During the Fall of 2022, I worked as a <game-developer></game-developer>, programming most of the puzzle mechanics and logic.",
            "link": "https://sciencedoge.itch.io/karnissas-castle",
            "photoGallery": [  
                "media/karnissascastle/karnissa1.png",
                "media/karnissascastle/karnissa2.png",
                "media/karnissascastle/karnissa3.png"
            ]
        }
    ]
}